{
    "Information Retrieval": {
    "description": "The Information Retrieval category includes tools for retrieving web-based content or answering queries through external sources. These tools support tasks such as web search, open-domain fact lookup, and retrieval-augmented response generation. You can basically use this category to search and retrieve whatever you want to know.",
    "tool_usage_notes": "When using online search tools, the max_results parameter MUST BE AT MOST 6 per query. For queries related to China-specific topics, consider translating the query into **Chinese** to better match the search engine styles.",
    "tools": [
      "bing_search",
      "get-stations-code-in-city",
      "get-station-code-of-citys",
      "get-station-code-by-names",
      "get-station-by-telecode",
      "get-tickets",
      "get-interline-tickets",
      "get-train-route-stations",
      "maps_weather"
    ]
  },
    "Programming & Tech Support": {
      "description": "The Programming & Tech Support category includes tools for executing code, executing shell command, running scripts, and interacting with system environments to support tasks such as debugging, automation, and developer operations.",
      "tool_usage_notes": "",
      "tools": [
        "execute_python_code",
        "execute_shell_command"
      ]
    },
    "Location & Navigation": {
      "description": "The Location & Navigation category includes tools for accessing and processing geospatial data, including walking, driving, cycling, and public transit navigation; distance estimation; geocoding and reverse geocoding; IP-based location detection; located weather retrieval; and various forms of location-based search such as keyword search, detailed POI lookup, and nearby place discovery. These tools support navigation and content generation tasks requiring spatial awareness, such as route descriptions, travel suggestions, and area-based comparisons.",
      "tool_usage_notes": "",
      "tools": [
        "maps_direction_bicycling",
        "maps_direction_driving",
        "maps_direction_transit_integrated",
        "maps_direction_walking",
        "maps_distance",
        "maps_geo",
        "maps_regeocode",
        "maps_ip_location",
        "maps_schema_personal_map",
        "maps_around_search",
        "maps_search_detail",
        "maps_text_search",
        "maps_schema_navi",
        "maps_schema_take_taxi",
        "maps_weather"
    ]
  }
  }
  